let handler = async (m, { conn, args }) => {
    let userId = m.mentionedJid && m.mentionedJid[0] ? m.mentionedJid[0] : m.sender
    let user = global.db.data.users[userId]
    let name = conn.getName(userId)
    let _uptime = process.uptime() * 1000
    let uptime = clockString(_uptime)
    let totalreg = Object.keys(global.db.data.users).length
    let totalCommands = Object.values(global.plugins).filter((v) => v.help && v.tags).length
    
    let txt = `
    ✦...*BIENENIDO*...✦
    ✦@${userId.split('@')[0]}✦

> ✰ Hola! Me llamo ✰
*${botname}*  

╭──────────┈ ↷
│ *❀ Modo BOT* »
│      Privado 
│ *✦ Bot* »
│    ${(conn.user.jid == global.conn.user.jid ? 'Principal 🅥' : 'Sup Bot🅑')}
│ *ⴵ Activada* »
│  ${uptime}
│ *✰ Total de usuarios* »
│     ${totalreg}
│ *✧ Total de Comandos* »
│  ${totalCommands}
╰─────────────

> ❍ Se bot en el grupo oficial del bot 

> ❍ Crea un *Sub-Bot* con tu número utilizando *#qr* o *#code*

• :･ﾟ⊹˚• \`『 𝐼𝑛𝑓𝑜-𝐵𝑜𝑡 』\` •˚⊹:･ﾟ•

❍ 𝐶𝑜𝑚𝑎𝑛𝑑𝑜𝑠 𝑝𝑎𝑟𝑎 𝑣𝑒𝑟 𝑒𝑠𝑡𝑎𝑑𝑜 𝑒 𝑖𝑛𝑓𝑜𝑟𝑚𝑎𝑐𝑖𝑜𝑛 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#ℎ𝑒𝑙𝑝 • #𝑚𝑒𝑛𝑢*
> ✦ 𝑉𝑒𝑟 𝑙𝑎 𝑙𝑖𝑠𝑡𝑎 𝑑𝑒 𝑐𝑜𝑚𝑎𝑛𝑑𝑜𝑠 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#𝑢𝑝𝑡𝑖𝑚𝑒 • #𝑟𝑢𝑛𝑡𝑖𝑚𝑒*
> ✦ 𝑉𝑒𝑟 𝑡𝑖𝑒𝑚𝑝𝑜 𝑎𝑐𝑡𝑖𝑣𝑜 𝑜 𝑒𝑛 𝑙𝑖𝑛𝑒𝑎 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#𝑠𝑐 • #𝑠𝑐𝑟𝑖𝑝𝑡*
> ✦ 𝐿𝑖𝑛𝑘 𝑑𝑒𝑙 𝑟𝑒𝑝𝑜𝑠𝑖𝑡𝑜𝑟𝑖𝑜 𝑜𝑓𝑖𝑐𝑖𝑎𝑙 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡
ᰔᩚ *#𝑠𝑡𝑎𝑓𝑓 • #𝑐𝑜𝑙𝑎𝑏𝑜𝑟𝑎𝑑𝑜𝑟𝑒𝑠*
> ✦ 𝑉𝑒𝑟 𝑙𝑎 𝑙𝑖𝑠𝑡𝑎 𝑑𝑒 𝑑𝑒𝑠𝑎𝑟𝑟𝑜𝑙𝑙𝑎𝑑𝑜𝑟𝑒𝑠 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#𝑠𝑒𝑟𝑏𝑜𝑡 • #𝑠𝑒𝑟𝑏𝑜𝑡 𝑐𝑜𝑑𝑒*
> ✦ 𝐶𝑟𝑒𝑎 𝑢𝑛𝑎 𝑠𝑒𝑠𝑖𝑜𝑛 𝑑𝑒 𝑆𝑢𝑏-𝐵𝑜𝑡.
ᰔᩚ *#𝑏𝑜𝑡𝑠 • #𝑠𝑜𝑐𝑘𝑒𝑡𝑠*
> ✦ 𝑉𝑒𝑟 𝑙𝑎 𝑙𝑖𝑠𝑡𝑎 𝑑𝑒 𝑆𝑢𝑏-𝐵𝑜𝑡𝑠 𝑎𝑐𝑡𝑖𝑣𝑜𝑠.
ᰔᩚ *#𝑐𝑟𝑒𝑎𝑑𝑜𝑟*
ᰔᩚ *#𝑠𝑡𝑎𝑡𝑢𝑠 • #𝑒𝑠𝑡𝑎𝑑𝑜*
> ✦ 𝑉𝑒𝑟 𝑒𝑙 𝑒𝑠𝑡𝑎𝑑𝑜 𝑎𝑐𝑡𝑢𝑎𝑙 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#𝑙𝑖𝑛𝑘𝑠 • #𝑔𝑟𝑢𝑝𝑜𝑠*
> ✦ 𝑉𝑒𝑟 𝑙𝑜𝑠 𝑒𝑛𝑙𝑎𝑐𝑒𝑠 𝑜𝑓𝑖𝑐𝑖𝑎𝑙𝑒𝑠 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#𝑖𝑛𝑓𝑜𝑏𝑜𝑡 • #𝑖𝑛𝑓𝑜𝑏𝑜𝑡*
> ✦ 𝑉𝑒𝑟 𝑙𝑎 𝑖𝑛𝑓𝑜𝑟𝑚𝑎𝑐𝑖𝑜𝑛 𝑐𝑜𝑚𝑝𝑙𝑒𝑡𝑎 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#𝑝 • #𝑝𝑖𝑛𝑔*
> ✦ 𝑉𝑒𝑟 𝑙𝑎 𝑣𝑒𝑙𝑜𝑐𝑖𝑑𝑎𝑑 𝑑𝑒 𝑟𝑒𝑠𝑝𝑢𝑒𝑠𝑡𝑎 𝑑𝑒𝑙 𝐵𝑜𝑡.
ᰔᩚ *#𝑠𝑖𝑠𝑡𝑒𝑚𝑎 • #𝑠𝑦𝑠𝑡𝑒𝑚*
> ✦ 𝑉𝑒𝑟 𝑒𝑠𝑡𝑎𝑑𝑜 𝑑𝑒𝑙 𝑠𝑖𝑠𝑡𝑒𝑚𝑎 𝑑𝑒 𝑎𝑙𝑜𝑗𝑎𝑚𝑖𝑒𝑛𝑡𝑜.
ᰔᩚ *#𝑠𝑝𝑒𝑒𝑑 • #𝑠𝑝𝑒𝑒𝑑𝑡𝑒𝑠𝑡*
> ✦ 𝑉𝑒𝑟 𝑙𝑎𝑠 𝑒𝑠𝑡𝑎𝑑𝑖𝑠𝑡𝑖𝑐𝑎𝑠 𝑑𝑒 𝑣𝑒𝑙𝑜𝑐𝑖𝑑𝑎𝑑 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#𝑣𝑖𝑒𝑤𝑠 • #𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠*
> ✦ 𝑉𝑒𝑟 𝑙𝑎 𝑐𝑎𝑛𝑡𝑖𝑑𝑎𝑑 𝑑𝑒 𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠 𝑟𝑒𝑔𝑖𝑠𝑡𝑟𝑎𝑑𝑜𝑠 𝑒𝑛 𝑒𝑙 𝑠𝑖𝑠𝑡𝑒𝑚𝑎.
ᰔᩚ *#𝑓𝑢𝑛𝑐𝑖𝑜𝑛𝑒𝑠 • #𝑡𝑜𝑡𝑎𝑙𝑓𝑢𝑛𝑐𝑖𝑜𝑛𝑒𝑠*
> ✦ 𝑉𝑒𝑟 𝑡𝑜𝑑𝑎𝑠 𝑙𝑎𝑠 𝑓𝑢𝑛𝑐𝑖𝑜𝑛𝑒𝑠 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.
ᰔᩚ *#𝑑𝑠 • #𝑓𝑖𝑥𝑚𝑠𝑔𝑒𝑠𝑝𝑒𝑟𝑎*
> ✦ 𝐸𝑙𝑖𝑚𝑖𝑛𝑎𝑟 𝑎𝑟𝑐ℎ𝑖𝑣𝑜𝑠 𝑑𝑒 𝑠𝑒𝑠𝑖𝑜𝑛 𝑖𝑛𝑛𝑒𝑐𝑒𝑠𝑎𝑟𝑖𝑜𝑠.
ᰔᩚ *#𝑒𝑑𝑖𝑡𝑎𝑢𝑡𝑜𝑟𝑒𝑠𝑝𝑜𝑛𝑑𝑒𝑟*
> ✦ 𝐶𝑜𝑛𝑓𝑖𝑔𝑢𝑟𝑎𝑟 𝑢𝑛 𝑃𝑟𝑜𝑚𝑝𝑡 𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑧𝑎𝑑𝑜 𝑑𝑒 𝑙𝑎 𝐵𝑜𝑡.

.

• :･ﾟ⊹˚• \`『 𝐺𝑟𝑢𝑝𝑜𝑠 』\` •˚⊹:･ﾟ•

❍ 𝐶𝑜𝑚𝑎𝑛𝑑𝑜𝑠 𝑑𝑒 𝑔𝑟𝑢𝑝𝑜𝑠 𝑝𝑎𝑟𝑎 𝑢𝑛𝑎 𝑚𝑒𝑗𝑜𝑟 𝑔𝑒𝑠𝑡𝑖𝑜𝑛 𝑑𝑒 𝑒𝑙𝑙𝑜𝑠.
ᰔᩚ *#𝑐𝑜𝑛𝑓𝑖𝑔 • #𝑜𝑛*
> ✦ 𝑉𝑒𝑟 𝑜𝑝𝑐𝑖𝑜𝑛𝑒𝑠 𝑑𝑒 𝑐𝑜𝑛𝑓𝑖𝑔𝑢𝑟𝑎𝑐𝑖𝑜𝑛 𝑑𝑒 𝑔𝑟𝑢𝑝𝑜𝑠.
ᰔᩚ *#ℎ𝑖𝑑𝑒𝑡𝑎𝑔*
> ✦ 𝐸𝑛𝑣𝑖𝑎 𝑢𝑛 𝑚𝑒𝑛𝑠𝑎𝑗𝑒 𝑚𝑒𝑛𝑐𝑖𝑜𝑛𝑎𝑛𝑑𝑜 𝑎 𝑡𝑜𝑑𝑜𝑠 𝑙𝑜𝑠 𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠
ᰔᩚ *#𝑔𝑝 • #𝑖𝑛𝑓𝑜𝑔𝑟𝑢𝑝𝑜*
> ✦  𝑉𝑒𝑟 𝑙𝑎 𝐼𝑛𝑓𝑜𝑟𝑚𝑎𝑐𝑖𝑜𝑛 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑙𝑖𝑛𝑒𝑎 • #𝑙𝑖𝑠𝑡𝑜𝑛𝑙𝑖𝑛𝑒*
> ✦ 𝑉𝑒𝑟 𝑙𝑎 𝑙𝑖𝑠𝑡𝑎 𝑑𝑒 𝑙𝑜𝑠 𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠 𝑒𝑛 𝑙𝑖𝑛𝑒𝑎.
ᰔᩚ *#𝑠𝑒𝑡𝑤𝑒𝑙𝑐𝑜𝑚𝑒*
> ✦ 𝐸𝑠𝑡𝑎𝑏𝑙𝑒𝑐𝑒𝑟 𝑢𝑛 𝑚𝑒𝑛𝑠𝑎𝑗𝑒 𝑑𝑒 𝑏𝑖𝑒𝑛𝑣𝑒𝑛𝑖𝑑𝑎 𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑧𝑎𝑑𝑜.
ᰔᩚ *#𝑠𝑒𝑡𝑏𝑦𝑒*
> ✦ 𝐸𝑠𝑡𝑎𝑏𝑙𝑒𝑐𝑒𝑟 𝑢𝑛 𝑚𝑒𝑛𝑠𝑎𝑗𝑒 𝑑𝑒 𝑑𝑒𝑠𝑝𝑒𝑑𝑖𝑑𝑎 𝑝𝑒𝑟𝑠𝑜𝑛𝑎𝑙𝑖𝑧𝑎𝑑𝑜.
ᰔᩚ *#𝑙𝑖𝑛𝑘*
> ✦ 𝐸𝑙 𝑏𝑜𝑡 𝑒𝑛𝑣𝑖𝑎 𝑒𝑙 𝑙𝑖𝑛𝑘 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑎𝑑𝑚𝑖𝑛𝑠 • #𝑎𝑑𝑚𝑖𝑛*
> ✦ 𝑀𝑒𝑛𝑐𝑖𝑜𝑛𝑎𝑟 𝑎 𝑙𝑜𝑠 𝑎𝑑𝑚𝑖𝑛𝑠 𝑝𝑎𝑟𝑎 𝑠𝑜𝑙𝑖𝑐𝑖𝑡𝑎𝑟 𝑎𝑦𝑢𝑑𝑎.
ᰔᩚ *#𝑟𝑒𝑠𝑡𝑎𝑏𝑙𝑒𝑐𝑒𝑟 • #𝑟𝑒𝑣𝑜𝑘𝑒*
> ✦ 𝑅𝑒𝑠𝑡𝑎𝑏𝑙𝑒𝑐𝑒𝑟 𝑒𝑙 𝑒𝑛𝑙𝑎𝑐𝑒 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑔𝑟𝑢𝑝𝑜 • #𝑔𝑟𝑜𝑢𝑝* [𝑜𝑝𝑒𝑛 / 𝑎𝑏𝑟𝑖𝑟]
> ✦ 𝐶𝑎𝑚𝑏𝑖𝑎 𝑎𝑗𝑢𝑠𝑡𝑒𝑠 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜 𝑝𝑎𝑟𝑎 𝑞𝑢𝑒 𝑡𝑜𝑑𝑜𝑠 𝑙𝑜𝑠 𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠 𝑒𝑛𝑣𝑖𝑒𝑛 𝑚𝑒𝑛𝑠𝑎𝑗𝑒.
ᰔᩚ *#𝑔𝑟𝑢𝑝𝑜 • #𝑔𝑟𝑢𝑜𝑝* [𝑐𝑙𝑜𝑠𝑒 / 𝑐𝑒𝑟𝑟𝑎𝑟]
> ✦ 𝐶𝑎𝑚𝑏𝑖𝑎 𝑎𝑗𝑢𝑠𝑡𝑒𝑠 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜 𝑝𝑎𝑟𝑎 𝑞𝑢𝑒 𝑠𝑜𝑙𝑜 𝑙𝑜𝑠 𝑎𝑑𝑚𝑖𝑛𝑖𝑠𝑡𝑟𝑎𝑑𝑜𝑟𝑒𝑠 𝑒𝑛𝑣𝑖𝑒𝑛 𝑚𝑒𝑛𝑠𝑎𝑗𝑒.
ᰔᩚ *#𝑘𝑖𝑐𝑘* [𝑛𝑢𝑚𝑒𝑟𝑜 / 𝑚𝑒𝑛𝑠𝑖𝑜𝑛]
> ✦ 𝐸𝑙𝑖𝑚𝑖𝑛𝑎 𝑢𝑛 𝑢𝑠𝑢𝑎𝑟𝑖𝑜 𝑑𝑒 𝑢𝑛 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑎𝑑𝑑 • #𝑎ñ𝑎𝑑𝑖𝑟 • #𝑎𝑔𝑟𝑒𝑔𝑎𝑟* [𝑛𝑢𝑚𝑒𝑟𝑜]
> ✦ 𝐼𝑛𝑣𝑖𝑡𝑎 𝑎 𝑢𝑛 𝑢𝑠𝑢𝑎𝑟𝑖𝑜 𝑎 𝑡𝑢 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑝𝑟𝑜𝑚𝑜𝑡𝑒* [𝑚𝑒𝑛𝑠𝑖𝑜𝑛 / 𝑒𝑡𝑖𝑞𝑢𝑒𝑡𝑎𝑟]
> ✦ 𝐸𝑙 𝑏𝑜𝑡 𝑑𝑎𝑟𝑎 𝑎𝑑𝑚𝑖𝑛𝑖𝑠𝑡𝑟𝑎𝑑𝑜𝑟 𝑎𝑙 𝑢𝑠𝑢𝑎𝑟𝑖𝑜 𝑚𝑒𝑛𝑐𝑖𝑜𝑛𝑎𝑛𝑑𝑜.
ᰔᩚ *#𝑑𝑒𝑚𝑜𝑡𝑒* [𝑚𝑒𝑛𝑠𝑖𝑜𝑛 / 𝑒𝑡𝑖𝑞𝑢𝑒𝑡𝑎𝑟]
> ✦ 𝐸𝑙 𝑏𝑜𝑡 𝑞𝑢𝑖𝑡𝑎𝑟𝑎 𝑎𝑑𝑚𝑖𝑛𝑖𝑠𝑡𝑟𝑎𝑑𝑜𝑟 𝑎𝑙 𝑢𝑠𝑢𝑎𝑟𝑖𝑜 𝑚𝑒𝑛𝑐𝑖𝑜𝑛𝑎𝑛𝑑𝑜.
ᰔᩚ *#𝑔𝑝𝑏𝑎𝑛𝑛𝑒𝑟 • #𝑔𝑟𝑜𝑢𝑝𝑖𝑚𝑔*
> ✦ 𝐶𝑎𝑚𝑏𝑖𝑎𝑟 𝑙𝑎 𝑖𝑚𝑎𝑔𝑒𝑛 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑔𝑝𝑛𝑎𝑚𝑒 • #𝑔𝑟𝑜𝑢𝑝𝑛𝑎𝑚𝑒*
> ✦ 𝐶𝑎𝑚𝑏𝑖𝑎𝑟 𝑒𝑙 𝑛𝑜𝑚𝑏𝑟𝑒 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑔𝑝𝑑𝑒𝑠𝑐 • #𝑔𝑟𝑜𝑢𝑝𝑑𝑒𝑠𝑐*
> ✦ 𝐶𝑎𝑚𝑏𝑖𝑎𝑟 𝑙𝑎 𝑑𝑒𝑠𝑐𝑟𝑖𝑝𝑐𝑖𝑜𝑛 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑎𝑑𝑣𝑒𝑟𝑡𝑖𝑟 • #𝑤𝑎𝑟𝑛 • #𝑤𝑎𝑟𝑛𝑖𝑛𝑔*
> ✦ 𝐷𝑎𝑟𝑙𝑒 𝑢𝑛𝑎 𝑎𝑑𝑣𝑒𝑟𝑡𝑒𝑛𝑐𝑖𝑎 𝑎𝑢𝑛 𝑢𝑠𝑢𝑎𝑟𝑖𝑜.
ᰔᩚ ︎*#𝑢𝑛𝑤𝑎𝑟𝑛 • #𝑑𝑒𝑙𝑤𝑎𝑟𝑛*
> ✦ 𝑄𝑢𝑖𝑡𝑎𝑟 𝑎𝑑𝑣𝑒𝑟𝑡𝑒𝑛𝑐𝑖𝑎𝑠.
ᰔᩚ *#𝑎𝑑𝑣𝑙𝑖𝑠𝑡 • #𝑙𝑖𝑠𝑡𝑎𝑑𝑣*
> ✦ 𝑉𝑒𝑟 𝑙𝑖𝑠𝑡𝑎 𝑑𝑒 𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠 𝑎𝑑𝑣𝑒𝑟𝑡𝑖𝑑𝑜𝑠.
ᰔᩚ *#𝑏𝑎𝑛𝑐ℎ𝑎𝑡*
> ✦ 𝐵𝑎𝑛𝑒𝑎𝑟 𝑒𝑙 𝐵𝑜𝑡 𝑒𝑛 𝑢𝑛 𝑐ℎ𝑎𝑡 𝑜 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑢𝑛𝑏𝑎𝑛𝑐ℎ𝑎𝑡*
> ✦ 𝐷𝑒𝑠𝑏𝑎𝑛𝑒𝑎𝑟 𝑒𝑙 𝐵𝑜𝑡 𝑑𝑒𝑙 𝑐ℎ𝑎𝑡 𝑜 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑚𝑢𝑡𝑒* [𝑚𝑒𝑛𝑠𝑖𝑜𝑛 / 𝑒𝑡𝑖𝑞𝑢𝑒𝑡𝑎𝑟]
> ✦ 𝐸𝑙 𝑏𝑜𝑡 𝑒𝑙𝑖𝑚𝑖𝑛𝑎 𝑙𝑜𝑠 𝑚𝑒𝑛𝑠𝑎𝑗𝑒𝑠 𝑑𝑒𝑙 𝑢𝑠𝑢𝑎𝑟𝑖𝑜.
ᰔᩚ *#𝑢𝑛𝑚𝑢𝑡𝑒* [𝑚𝑒𝑛𝑠𝑖𝑜𝑛 / 𝑒𝑡𝑖𝑞𝑢𝑒𝑡𝑎𝑟]
> ✦ 𝐸𝑙 𝑏𝑜𝑡 𝑑𝑒𝑗𝑎 𝑑𝑒 𝑒𝑙𝑖𝑚𝑖𝑛𝑎𝑟 𝑙𝑜𝑠 𝑚𝑒𝑛𝑠𝑎𝑗𝑒𝑠 𝑑𝑒𝑙 𝑢𝑠𝑢𝑎𝑟𝑖𝑜.
ᰔᩚ *#𝑒𝑛𝑐𝑢𝑒𝑠𝑡𝑎 • #𝑝𝑜𝑙𝑙*
> ✦ 𝐶𝑟𝑒𝑎 𝑢𝑛𝑎 𝑒𝑛𝑐𝑢𝑒𝑠𝑡𝑎.
ᰔᩚ *#𝑑𝑒𝑙𝑒𝑡𝑒 • #𝑑𝑒𝑙*
> ✦ 𝐸𝑙𝑖𝑚𝑖𝑛𝑎 𝑚𝑒𝑛𝑠𝑎𝑗𝑒 𝑑𝑒 𝑜𝑡𝑟𝑜𝑠 𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠.
ᰔᩚ *#𝑓𝑎𝑛𝑡𝑎𝑠𝑚𝑎𝑠*
> ✦ 𝑉𝑒𝑟 𝑙𝑖𝑠𝑡𝑎 𝑑𝑒 𝑖𝑛𝑎𝑐𝑡𝑖𝑣𝑜𝑠 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑘𝑖𝑐𝑘𝑓𝑎𝑛𝑡𝑎𝑠𝑚𝑎𝑠*
> ✦ 𝐸𝑙𝑖𝑚𝑖𝑛𝑎 𝑎 𝑙𝑜𝑠 𝑖𝑛𝑎𝑐𝑡𝑖𝑣𝑜𝑠 𝑑𝑒𝑙 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑖𝑛𝑣𝑜𝑐𝑎𝑟 • #𝑡𝑎𝑔𝑎𝑙𝑙 • #𝑡𝑜𝑑𝑜𝑠*
> ✦ 𝐼𝑛𝑣𝑜𝑐𝑎 𝑎 𝑡𝑜𝑑𝑜𝑠 𝑙𝑜𝑠 𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠 𝑑𝑒 𝑢𝑛 𝑔𝑟𝑢𝑝𝑜.
ᰔᩚ *#𝑠𝑒𝑡𝑒𝑚𝑜𝑗𝑖 • #𝑠𝑒𝑡𝑒𝑚𝑜*
> ✦ 𝐶𝑎𝑚𝑏𝑖𝑎 𝑒𝑙 𝑒𝑚𝑜𝑗𝑖 𝑞𝑢𝑒 𝑠𝑒 𝑢𝑠𝑎 𝑒𝑛 𝑙𝑎 𝑖𝑛𝑣𝑖𝑡𝑎𝑐𝑖𝑜𝑛 𝑑𝑒 𝑢𝑠𝑢𝑎𝑟𝑖𝑜𝑠.
ᰔᩚ *#𝑙𝑖𝑠𝑡𝑛𝑢𝑚 • #𝑘𝑖𝑐𝑘𝑛𝑢𝑚*
> ✦ 𝐸𝑙𝑖𝑚𝑖𝑛𝑒 𝑎 𝑢𝑠𝑢𝑎𝑟𝑖𝑜 𝑝𝑜𝑟 𝑒𝑙 𝑝𝑟𝑒𝑓𝑖𝑗𝑜 𝑑𝑒 𝑝𝑎𝑖𝑠..

  `.trim()

  await conn.sendMessage(m.chat, { 
      text: txt,
      contextInfo: {
          mentionedJid: [m.sender, userId],
          isForwarded: true,
          forwardedNewsletterMessageInfo: {
              newsletterJid: channelRD.id,
              newsletterName: channelRD.name,
              serverMessageId: -1,
          },
          forwardingScore: 999,
          externalAdReply: {
              title: botname,
              body: textbot,
              thumbnailUrl: banner,
              sourceUrl: redes,
              mediaType: 1,
              showAdAttribution: true,
              renderLargerThumbnail: true,
          },
      },
  }, { quoted: m })

}

handler.help = ['menu']
handler.tags = ['main']
handler.command = ['menu', 'menú', 'help']

export default handler

function clockString(ms) {
    let seconds = Math.floor((ms / 1000) % 60)
    let minutes = Math.floor((ms / (1000 * 60)) % 60)
    let hours = Math.floor((ms / (1000 * 60 * 60)) % 24)
    return `${hours}h ${minutes}m ${seconds}s`
}
